cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

// Процедура - Данные среза
//
// Параметры:
//  Схема				 - СхемаЗапроса	 	- Хранилище текста запроса 
//  ПараметрыОтбора		 - Структура	 	- 
//  ТаблицаДляПомещения	 - Строка	 		- Имя формируемой временной таблицы
//
Процедура АктивныеТочкиУчетаПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт 
	
	ЗаполнитьСхемуАктуальноеСостояниеТочекУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения);
	
КонецПроцедуры

Процедура АктуальноеСостояниеТочекУчетаПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт 
	
	ЗаполнитьСхемуАктуальноеСостояниеТочекУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения, Истина);

КонецПроцедуры

Процедура АктивныеТочкиУчетаПомещенияБезПУ(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеПриборыУчетаПомещения");
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеПриборыУчетаПомещения" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеПриборыУчетаПомещения");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеТочкиУчетаАбонентаБезПУ());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
КонецПроцедуры

Процедура АктивныеТочкиУчетаПомещенияСПУ(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыТочекУчета.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочек"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыДействующихТочек" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыТочекУчета.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочек");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеТочкиУчетаАбонентаСПУ());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСхемуАктуальноеСостояниеТочекУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "", БезОтбораСостояния = Ложь)
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргВладельцыТочекУчета.ТочкиУчетаПомещения(Схема, ПараметрыОтбора, "ТочкиУчетаПомещения"); 
		РегистрыСведений.энргАбонентыПомещений.ТекущийАбонентВПомещении(Схема, ПараметрыОтбора, "АбонентыПомещений");
	Иначе
		ЕстьТочкиУчетаПомещения 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ТочкиУчетаПомещения" Тогда
				ЕстьТочкиУчетаПомещения = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьТочкиУчетаПомещения Тогда
			РегистрыСведений.энргВладельцыТочекУчета.ТочкиУчетаПомещения(Схема, ПараметрыОтбора, "ТочкиУчетаПомещения");		
		КонецЕсли;
		
		ЕстьАбонентыПомещений 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "АбонентыПомещений" Тогда
				ЕстьАбонентыПомещений = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьАбонентыПомещений Тогда
			РегистрыСведений.энргАбонентыПомещений.ТекущийАбонентВПомещении(Схема, ПараметрыОтбора, "АбонентыПомещений");		
		КонецЕсли;
	КонецЕсли;
	
	ДополнитьТекстЗапросаМаксимальныйПериодАктивностиТочекУчета(Схема, ПараметрыОтбора);
	ДополнитьТекстЗапросаМаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента(Схема, ПараметрыОтбора);
	ДополнитьТекстЗапросаАктуальноеСостояниеТочкиУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения, БезОтбораСостояния);
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаМаксимальныйПериодАктивностиТочекУчета(Схема, ПараметрыОтбора)
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныйПериодАктивностиТочекУчета());
	ОператорВыбора 	= Пакет.Операторы[0];	
	Источник 		= ОператорВыбора.Источники[0].Источник;
	Параметры 		= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ОператорВыбора.Отбор.Добавить(Новый ВыражениеСхемыЗапроса("энргАктивностьТочекУчета.Период <= &" + ПараметрыОтбора["Период"].ИмяПараметра));
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 				= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор		= "энргАктивностьТочекУчета";
		ДоступныеПараметры 	= "Организация, Район, КлючПомещения, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Отбор, ИмяТаблицыОтбор, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);				
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаМаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента(Схема, ПараметрыОтбора)
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента());
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаАктуальноеСостояниеТочкиУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения, БезОтбораСостояния)
	
	НачальныйТекст 	 = ТекстЗапросаАктуальноеСостояниеТочкиУчета();
	УсловиеСостояния = "&СостояниеТочкиУчета";
	
	Если НЕ БезОтбораСостояния Тогда	
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "ТочкиОРП", ЛОЖЬ) Тогда 
			СостояниеОРП = "энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП)";
			НачальныйТекст = СтрЗаменить(НачальныйТекст, УсловиеСостояния, СостояниеОРП);		
		ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтбора, "ВключаяОРП", ЛОЖЬ) Тогда 
			СостояниеОРП = "
			|	(энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
			|			ИЛИ энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП))";
			
			НачальныйТекст = СтрЗаменить(НачальныйТекст, УсловиеСостояния, СостояниеОРП);
		Иначе 
			СостояниеОРП = "энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)";
			НачальныйТекст = СтрЗаменить(НачальныйТекст, УсловиеСостояния, СостояниеОРП);  
		КонецЕсли;
		
	Иначе
		
		 НачальныйТекст = СтрЗаменить(НачальныйТекст, УсловиеСостояния, "Истина");
		
	КонецЕсли;
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(НачальныйТекст); 	
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
КонецПроцедуры

#Область ПолучениеДанных_ТекстЗапросов

Функция ТекстЗапросаМаксимальныйПериодАктивностиТочекУчета()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчета.Организация КАК Организация,
	|	энргАктивностьТочекУчета.Район КАК Район,
	|	энргАктивностьТочекУчета.КлючПомещения КАК КлючПомещения,
	|	энргАктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргАктивностьТочекУчета.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальныйПериодАктивностиТочекУчета
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчетаПомещения КАК ТочкиУчетаПомещения
	|		ПО энргАктивностьТочекУчета.Организация = ТочкиУчетаПомещения.Организация
	|			И энргАктивностьТочекУчета.Район = ТочкиУчетаПомещения.Район
	|			И энргАктивностьТочекУчета.КлючПомещения = ТочкиУчетаПомещения.КлючПомещения
	|			И энргАктивностьТочекУчета.ТочкаУчета = ТочкиУчетаПомещения.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	энргАктивностьТочекУчета.Организация,
	|	энргАктивностьТочекУчета.Район,
	|	энргАктивностьТочекУчета.КлючПомещения,
	|	энргАктивностьТочекУчета.ТочкаУчета";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаМаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента()
	
	Текст = 
	"ВЫБРАТЬ
	|	МаксимальныйПериодАктивностиТочекУчета.Организация КАК Организация,
	|	МаксимальныйПериодАктивностиТочекУчета.Район КАК Район,
	|	МаксимальныйПериодАктивностиТочекУчета.КлючПомещения КАК КлючПомещения,
	|	МаксимальныйПериодАктивностиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(МаксимальныйПериодАктивностиТочекУчета.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента
	|ИЗ
	|	МаксимальныйПериодАктивностиТочекУчета КАК МаксимальныйПериодАктивностиТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|		ПО МаксимальныйПериодАктивностиТочекУчета.Организация = АбонентыПомещений.Организация
	|			И МаксимальныйПериодАктивностиТочекУчета.Район = АбонентыПомещений.Район
	|			И МаксимальныйПериодАктивностиТочекУчета.КлючПомещения = АбонентыПомещений.КлючПомещения
	|ГДЕ
	|	МаксимальныйПериодАктивностиТочекУчета.Период >= ЕСТЬNULL(АбонентыПомещений.Период, ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйПериодАктивностиТочекУчета.Организация,
	|	МаксимальныйПериодАктивностиТочекУчета.Район,
	|	МаксимальныйПериодАктивностиТочекУчета.КлючПомещения,
	|	МаксимальныйПериодАктивностиТочекУчета.ТочкаУчета";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктуальноеСостояниеТочкиУчета()
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргАктивностьТочекУчета.Состояние КАК Состояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргАктивностьТочекУчета.Период КАК Период,
	|		энргАктивностьТочекУчета.Организация КАК Организация,
	|		энргАктивностьТочекУчета.Район КАК Район,
	|		энргАктивностьТочекУчета.КлючПомещения КАК КлючПомещения,
	|		энргАктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргАктивностьТочекУчета.Регистратор) КАК Регистратор
	|	ИЗ
	|		МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента КАК МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|			ПО МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента.Организация = энргАктивностьТочекУчета.Организация
	|				И МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента.Район = энргАктивностьТочекУчета.Район
	|				И МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента.КлючПомещения = энргАктивностьТочекУчета.КлючПомещения
	|				И МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента.ТочкаУчета = энргАктивностьТочекУчета.ТочкаУчета
	|				И МаксимальныйПериодАктивностиТочекУчетаПослеСменыАбонента.Период = энргАктивностьТочекУчета.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргАктивностьТочекУчета.Организация,
	|		энргАктивностьТочекУчета.КлючПомещения,
	|		энргАктивностьТочекУчета.ТочкаУчета,
	|		энргАктивностьТочекУчета.Район,
	|		энргАктивностьТочекУчета.Период) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|		ПО ВложенныйЗапрос.Период = энргАктивностьТочекУчета.Период
	|			И ВложенныйЗапрос.Регистратор = энргАктивностьТочекУчета.Регистратор
	|			И ВложенныйЗапрос.Организация = энргАктивностьТочекУчета.Организация
	|			И ВложенныйЗапрос.Район = энргАктивностьТочекУчета.Район
	|			И ВложенныйЗапрос.КлючПомещения = энргАктивностьТочекУчета.КлючПомещения
	|			И ВложенныйЗапрос.ТочкаУчета = энргАктивностьТочекУчета.ТочкаУчета
	|ГДЕ
	|	&СостояниеТочкиУчета";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктивныеТочкиУчетаАбонентаБезПУ()
	
	Текст =
	"ВЫБРАТЬ
	|	ДействующиеТочки.Организация КАК Организация,
	|	ДействующиеТочки.Район КАК Район,
	|	ДействующиеТочки.КлючПомещения КАК КлючПомещения,
	|	ДействующиеТочки.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	ДействующиеТочки КАК ДействующиеТочки
	|ГДЕ
	|	НЕ ДействующиеТочки.ТочкаУчета В
	|				(ВЫБРАТЬ
	|					ДействующиеПриборыУчетаПомещения.ТочкаУчета
	|				ИЗ
	|					ДействующиеПриборыУчетаПомещения)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктивныеТочкиУчетаАбонентаСПУ()
	
	Текст =
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргАктивностьТочекУчетаСрезПоследних.Район КАК Район,
	|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения) В
	|				(ВЫБРАТЬ
	|					ПриборыДействующихТочек.Организация,
	|					ПриборыДействующихТочек.Район,
	|					ПриборыДействующихТочек.КлючПомещения
	|				ИЗ
	|					ПриборыДействующихТочек КАК ПриборыДействующихТочек)) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(ПЕречисление.энргСостояниеТочекУчета.Включена)
	|	И НЕ энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета В
	|				(ВЫБРАТЬ
	|					ПриборыДействующихТочек.ТочкаУчета
	|				ИЗ
	|					ПриборыДействующихТочек)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
